OpenFOAM/OpenFOAM-5.x/tutorials/electromagnetics/mhdFoam/hartmann/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line_centreProfile
    {
        type    uniform;
        axis    distance;
        start   (10.001 -1 0.01);
        end     (10.001 1 0.01);
        nPoints 100;
    }
);

fields          ( Ux );


// ************************************************************************* //
